# catalog/data.py

SITE_INFO = {
    "title": "Каталог курсов по DOTA 2",
    "about": "Мини-сайт для улучшения умений игроков Defense Of The Ancients 2 путём составления курсов для обучения"
}

AUTHORS = [
    {"id": 1, "name": "Илья Мулярчук", "bio": "Игрок команды TEAM SPIRIT."},
    {"id": 2, "name": "Денис Сигитов", "bio": "Игрок команды TEAM SPIRIT."},
    {"id": 3, "name": "Магомед Халилов", "bio": "Игрок команды TEAM SPIRIT."},
    {"id": 4, "name": "Александр Филин", "bio": "Игрок команды TEAM SPIRIT."},
    {"id": 5, "name": "Ярослав Найденов", "bio": "Игрок команды TEAM SPIRIT."},
    {"id": 6, "name": "Сергей Жаркой", "bio": "Стример и профессиональный выпиватель пива."},
]

COURSES = [
    {"id": 1, "title": "Гайд на керри (1 pos)", "description": "Научись фармить под 1000 золота в минуту как YATORO", "author_id": 1, "level": "Титан"},
    {"id": 2, "title": "Гайд на мидера (2 pos)", "description": "Нагибай на миду любого чемпиона как LARL", "author_id": 2, "level": "Титан"},
    {"id": 3, "title": "Гайд на инициатора (3 pos)", "description": "Увози врагов под фонтан как будто ты COLLAPSE", "author_id": 3, "level": "Титан"},
    {"id": 4, "title": "Гайд на полусаппорта (4 pos)", "description": "Выходи на ганги к своему мидеру под таймер рун как MIRA", "author_id": 4, "level": "Титан"},
    {"id": 5, "title": "Гайд на фуллсаппорта (5 pos)", "description": "Помогай своему керри и ставь обзор прямо как MIPOSHKA", "author_id": 5, "level": "Титан"},
    {"id": 6, "title": "Гайд как выбраться с рекрутов", "description": "Подробная инткрукция как выбраться с рекрутов на любом герое", "author_id": 6, "level": "Рекрут"},
    {"id": 6, "title": "Как понять что ты бездарь", "description": "Простые привычки, присущие только бездарям", "author_id": 6, "level": "Рыцарь"},
    {"id": 6, "title": "Полный гайд для DOTA 2", "description": "Общие действия для повышения своего процента побед", "author_id": 6, "level": "Страж"},
]
